project-root/app/Controllers/Admin/DashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `reservas`
WHERE `estado` IN ('pendiente','confirmada')
---
    public function index()
    {
        try {
            // Lógica original de tu compañero (Consultas a Modelos)
            $data = [
                'prestamos_activos'         => count((new RegistroModel())->activos()),
                'prestamos_vencidos'        => count((new RegistroModel())->vencidos()),
                'reservas_pendientes'       => (new ReservaModel())->whereIn('estado', ['pendiente', 'disponible_para_retiro'])->countAllResults(),