project-root/app/Controllers/Admin/NotificacionController.php

    public function index()
    {
        $data['notificaciones'] = (new NotificacionModel())
            ->select('notificaciones.*, usuarios.nombre_completo')
            ->join('usuarios', 'usuarios.dni = notificaciones.dniUsuario', 'left')
            ->where('notificaciones.canal', 'sistema')
            ->orderBy('notificaciones.id', 'DESC')
            ->findAll(100);
---
SELECT `notificaciones`.*, `usuarios`.`nombre_completo`
FROM `notificaciones`
LEFT JOIN `usuarios` ON `usuarios`.`dni` = `notificaciones`.`dniUsuario`
WHERE `notificaciones`.`canal` = 'sistema'
ORDER BY `notificaciones`.`id` DESC
 LIMIT 100