project-root/app/Controllers/Admin/PromocionController.php

SELECT *
FROM `promociones`
ORDER BY `fecha_inicio` DESC
---
    public function index()
    {
        $data['promociones'] = $this->promociones->orderBy('fecha_inicio', 'DESC')->findAll();