project-root/app/Models/RegistroModel.php

    public function activos()
    {
        return $this->where('fechaDevolucion', null)
                    ->select('registros.*, libros.titulo, usuarios.nombre_completo as socio_nombre')
                    ->join('libros', 'libros.id = registros.idlibro', 'left')
                    ->join('usuarios', 'usuarios.dni = registros.dniUsuario', 'left')
                    ->orderBy('registros.fechaVence', 'ASC')
                    ->findAll();
---
SELECT `registros`.*, `libros`.`titulo`, `libros`.`autor`, `libros`.`isbn`, `usuarios`.`dni` AS `socio_dni`, `usuarios`.`nombre_completo` AS `socio_nombre`
FROM `registros`
LEFT JOIN `libros` ON `libros`.`id` = `registros`.`idlibro`
LEFT JOIN `usuarios` ON `usuarios`.`dni` = `registros`.`dniUsuario`
WHERE `registros`.`fechaDevolucion` IS NULL
ORDER BY `registros`.`fechaVence` ASC

    public function vencidos()
    {
        return $this->where('fechaDevolucion', null)
                    ->where('fechaVence <', date('Y-m-d'))
                    ->select('registros.*, libros.titulo, usuarios.nombre_completo as socio_nombre')
                    ->join('libros', 'libros.id = registros.idlibro', 'left')
                    ->join('usuarios', 'usuarios.dni = registros.dniUsuario', 'left')
                    ->orderBy('registros.fechaVence', 'ASC')
                    ->findAll();
---
SELECT `registros`.*, `libros`.`titulo`, `libros`.`autor`, `libros`.`isbn`, `usuarios`.`dni` AS `socio_dni`, `usuarios`.`nombre_completo` AS `socio_nombre`
FROM `registros`
LEFT JOIN `libros` ON `libros`.`id` = `registros`.`idlibro`
LEFT JOIN `usuarios` ON `usuarios`.`dni` = `registros`.`dniUsuario`
WHERE `registros`.`fechaDevolucion` IS NULL
AND `registros`.`fechaVence` < '2026-10-01'
ORDER BY `registros`.`fechaVence` ASC