project-root/app/Models/ReservaModel.php

    public function pendientesConDatos(): array
    {
        $reservas = $this->select(
                'reservas.*, libros.titulo, usuarios.nombre_completo AS socio_nombre'
            )
            ->join('libros', 'libros.id = reservas.libro_id')
            ->join('usuarios', 'usuarios.dni = reservas.socio_id')
            ->whereIn('reservas.estado', ['pendiente', 'confirmada'])
            ->orderBy('reservas.libro_id', 'ASC')
            ->orderBy('reservas.fecha_solicitud', 'ASC')
            ->findAll();
---
SELECT `reservas`.*, `libros`.`titulo`, `usuarios`.`nombre_completo` AS `socio_nombre`
FROM `reservas`
JOIN `libros` ON `libros`.`id` = `reservas`.`libro_id`
JOIN `usuarios` ON `usuarios`.`dni` = `reservas`.`socio_id`
WHERE `reservas`.`estado` IN ('pendiente','confirmada')
ORDER BY `reservas`.`libro_id` ASC, `reservas`.`fecha_solicitud` ASC