project-root/app/Models/UsuarioModel.php

SELECT *
FROM `usuarios`
WHERE `mail` = 'socio@biblioteca.local'
AND `estado` = 'activo'
 LIMIT 1
UPDATE `usuarios` SET `ultimo_login` = '2026-10-01 21:47:11', `updated_at` = '2026-10-01 21:47:11'
WHERE `usuarios`.`dni` IN ('31001002')
---
    public function verificarCredenciales(string $email, string $password): ?array
    {
        $usuario = $this->where('mail', $email)->where('estado', 'activo')->first();

        if ($usuario && password_verify($password, $usuario['password_hash'])) {
            $this->update($usuario['dni'], ['ultimo_login' => date('Y-m-d H:i:s')]);