project-root/app/Controllers/Publico/SocioPortalController.php

    public function autenticar()
    {
        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $usuario = $this->usuarioModel
            ->where('mail', $email)
            ->where('perfil', 'socio')
            ->where('estado', 'activo')
            ->first();

        if (! $usuario || ! password_verify($password, $usuario['password_hash'])) {
            return redirect()->back()->withInput()->with('error', 'Email o contraseña inválidos.');
        }

        // Actualizar último login
        $this->usuarioModel->update($usuario['dni'], ['ultimo_login' => date('Y-m-d H:i:s')]);
---
SELECT *
FROM `usuarios`
WHERE `mail` = 'socio@biblioteca.local'
AND `perfil` = 'socio'
AND `estado` = 'activo'
 LIMIT 1
UPDATE `usuarios` SET `ultimo_login` = '2026-10-05 22:51:17', `updated_at` = '2026-10-05 22:51:17'
WHERE `usuarios`.`dni` IN ('31001002')

    public function home()
    {
        $socio_dni = session()->get('socio_dni');
        $socio = $this->usuarioModel->find($socio_dni);

        if (! $socio) {
            session()->destroy();
            return redirect()->to('/socio/login')->with('error', 'Usuario no encontrado.');
        }

        $registros = $this->registroModel
            ->select('registros.*, libros.titulo, libros.autor')
            ->join('libros', 'registros.idlibro = libros.id')
            ->where('registros.dniUsuario', $socio_dni)
            ->orderBy('registros.fechaPrestamo', 'DESC')
            ->findAll();
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`dni` = '31001002'
SELECT `registros`.*, `libros`.`titulo`, `libros`.`autor`
FROM `registros`
JOIN `libros` ON `registros`.`idlibro` = `libros`.`id`
WHERE `registros`.`dniUsuario` = '31001002'
ORDER BY `registros`.`fechaPrestamo` DESC